{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "special": true,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 1,
      "special": true,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 2,
      "special": true,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 3,
      "special": true,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 4,
      "special": true,
      "content": "<mask>",
      "single_word": false,
      "lstrip": true,
      "rstrip": false,
      "normalized": true
    },
    {
      "id": 5,
      "special": true,
      "content": "<extra_id_99>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 6,
      "special": true,
      "content": "<extra_id_98>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 7,
      "special": true,
      "content": "<extra_id_97>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 8,
      "special": true,
      "content": "<extra_id_96>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 9,
      "special": true,
      "content": "<extra_id_95>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 10,
      "special": true,
      "content": "<extra_id_94>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 11,
      "special": true,
      "content": "<extra_id_93>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 12,
      "special": true,
      "content": "<extra_id_92>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 13,
      "special": true,
      "content": "<extra_id_91>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 14,
      "special": true,
      "content": "<extra_id_90>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 15,
      "special": true,
      "content": "<extra_id_89>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 16,
      "special": true,
      "content": "<extra_id_88>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 17,
      "special": true,
      "content": "<extra_id_87>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 18,
      "special": true,
      "content": "<extra_id_86>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 19,
      "special": true,
      "content": "<extra_id_85>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 20,
      "special": true,
      "content": "<extra_id_84>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 21,
      "special": true,
      "content": "<extra_id_83>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 22,
      "special": true,
      "content": "<extra_id_82>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 23,
      "special": true,
      "content": "<extra_id_81>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 24,
      "special": true,
      "content": "<extra_id_80>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 25,
      "special": true,
      "content": "<extra_id_79>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 26,
      "special": true,
      "content": "<extra_id_78>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 27,
      "special": true,
      "content": "<extra_id_77>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 28,
      "special": true,
      "content": "<extra_id_76>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 29,
      "special": true,
      "content": "<extra_id_75>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 30,
      "special": true,
      "content": "<extra_id_74>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 31,
      "special": true,
      "content": "<extra_id_73>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 32,
      "special": true,
      "content": "<extra_id_72>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 33,
      "special": true,
      "content": "<extra_id_71>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 34,
      "special": true,
      "content": "<extra_id_70>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 35,
      "special": true,
      "content": "<extra_id_69>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 36,
      "special": true,
      "content": "<extra_id_68>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 37,
      "special": true,
      "content": "<extra_id_67>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 38,
      "special": true,
      "content": "<extra_id_66>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 39,
      "special": true,
      "content": "<extra_id_65>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 40,
      "special": true,
      "content": "<extra_id_64>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 41,
      "special": true,
      "content": "<extra_id_63>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 42,
      "special": true,
      "content": "<extra_id_62>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 43,
      "special": true,
      "content": "<extra_id_61>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 44,
      "special": true,
      "content": "<extra_id_60>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 45,
      "special": true,
      "content": "<extra_id_59>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 46,
      "special": true,
      "content": "<extra_id_58>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 47,
      "special": true,
      "content": "<extra_id_57>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 48,
      "special": true,
      "content": "<extra_id_56>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 49,
      "special": true,
      "content": "<extra_id_55>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 50,
      "special": true,
      "content": "<extra_id_54>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 51,
      "special": true,
      "content": "<extra_id_53>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 52,
      "special": true,
      "content": "<extra_id_52>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 53,
      "special": true,
      "content": "<extra_id_51>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 54,
      "special": true,
      "content": "<extra_id_50>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 55,
      "special": true,
      "content": "<extra_id_49>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 56,
      "special": true,
      "content": "<extra_id_48>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 57,
      "special": true,
      "content": "<extra_id_47>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 58,
      "special": true,
      "content": "<extra_id_46>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 59,
      "special": true,
      "content": "<extra_id_45>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 60,
      "special": true,
      "content": "<extra_id_44>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 61,
      "special": true,
      "content": "<extra_id_43>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 62,
      "special": true,
      "content": "<extra_id_42>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 63,
      "special": true,
      "content": "<extra_id_41>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 64,
      "special": true,
      "content": "<extra_id_40>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 65,
      "special": true,
      "content": "<extra_id_39>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 66,
      "special": true,
      "content": "<extra_id_38>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 67,
      "special": true,
      "content": "<extra_id_37>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 68,
      "special": true,
      "content": "<extra_id_36>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 69,
      "special": true,
      "content": "<extra_id_35>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 70,
      "special": true,
      "content": "<extra_id_34>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 71,
      "special": true,
      "content": "<extra_id_33>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 72,
      "special": true,
      "content": "<extra_id_32>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 73,
      "special": true,
      "content": "<extra_id_31>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 74,
      "special": true,
      "content": "<extra_id_30>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 75,
      "special": true,
      "content": "<extra_id_29>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 76,
      "special": true,
      "content": "<extra_id_28>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 77,
      "special": true,
      "content": "<extra_id_27>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 78,
      "special": true,
      "content": "<extra_id_26>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 79,
      "special": true,
      "content": "<extra_id_25>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 80,
      "special": true,
      "content": "<extra_id_24>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 81,
      "special": true,
      "content": "<extra_id_23>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 82,
      "special": true,
      "content": "<extra_id_22>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 83,
      "special": true,
      "content": "<extra_id_21>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 84,
      "special": true,
      "content": "<extra_id_20>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 85,
      "special": true,
      "content": "<extra_id_19>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 86,
      "special": true,
      "content": "<extra_id_18>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 87,
      "special": true,
      "content": "<extra_id_17>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 88,
      "special": true,
      "content": "<extra_id_16>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 89,
      "special": true,
      "content": "<extra_id_15>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 90,
      "special": true,
      "content": "<extra_id_14>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 91,
      "special": true,
      "content": "<extra_id_13>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 92,
      "special": true,
      "content": "<extra_id_12>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 93,
      "special": true,
      "content": "<extra_id_11>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 94,
      "special": true,
      "content": "<extra_id_10>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 95,
      "special": true,
      "content": "<extra_id_9>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 96,
      "special": true,
      "content": "<extra_id_8>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 97,
      "special": true,
      "content": "<extra_id_7>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 98,
      "special": true,
      "content": "<extra_id_6>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 99,
      "special": true,
      "content": "<extra_id_5>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 100,
      "special": true,
      "content": "<extra_id_4>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 101,
      "special": true,
      "content": "<extra_id_3>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 102,
      "special": true,
      "content": "<extra_id_2>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 103,
      "special": true,
      "content": "<extra_id_1>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    },
    {
      "id": 104,
      "special": true,
      "content": "<extra_id_0>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": false,
    "trim_offsets": true
  },
  "post_processor": {
    "type": "RobertaProcessing",
    "sep": [
      "</s>",
      2
    ],
    "cls": [
      "<s>",
      1
    ],
    "trim_offsets": true,
    "add_prefix_space": false
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": "",
    "end_of_word_suffix": "",
    "fuse_unk": false,
    "vocab": {
      "<pad>": 0,
      "<s>": 1,
      "</s>": 2,
      "<unk>": 3,
      "<mask>": 4,
      "<extra_id_99>": 5,
      "<extra_id_98>": 6,
      "<extra_id_97>": 7,
      "<extra_id_96>": 8,
      "<extra_id_95>": 9,
      "<extra_id_94>": 10,
      "<extra_id_93>": 11,
      "<extra_id_92>": 12,
      "<extra_id_91>": 13,
      "<extra_id_90>": 14,
      "<extra_id_89>": 15,
      "<extra_id_88>": 16,
      "<extra_id_87>": 17,
      "<extra_id_86>": 18,
      "<extra_id_85>": 19,
      "<extra_id_84>": 20,
      "<extra_id_83>": 21,
      "<extra_id_82>": 22,
      "<extra_id_81>": 23,
      "<extra_id_80>": 24,
      "<extra_id_79>": 25,
      "<extra_id_78>": 26,
      "<extra_id_77>": 27,
      "<extra_id_76>": 28,
      "<extra_id_75>": 29,
      "<extra_id_74>": 30,
      "<extra_id_73>": 31,
      "<extra_id_72>": 32,
      "<extra_id_71>": 33,
      "<extra_id_70>": 34,
      "<extra_id_69>": 35,
      "<extra_id_68>": 36,
      "<extra_id_67>": 37,
      "<extra_id_66>": 38,
      "<extra_id_65>": 39,
      "<extra_id_64>": 40,
      "<extra_id_63>": 41,
      "<extra_id_62>": 42,
      "<extra_id_61>": 43,
      "<extra_id_60>": 44,
      "<extra_id_59>": 45,
      "<extra_id_58>": 46,
      "<extra_id_57>": 47,
      "<extra_id_56>": 48,
      "<extra_id_55>": 49,
      "<extra_id_54>": 50,
      "<extra_id_53>": 51,
      "<extra_id_52>": 52,
      "<extra_id_51>": 53,
      "<extra_id_50>": 54,
      "<extra_id_49>": 55,
      "<extra_id_48>": 56,
      "<extra_id_47>": 57,
      "<extra_id_46>": 58,
      "<extra_id_45>": 59,
      "<extra_id_44>": 60,
      "<extra_id_43>": 61,
      "<extra_id_42>": 62,
      "<extra_id_41>": 63,
      "<extra_id_40>": 64,
      "<extra_id_39>": 65,
      "<extra_id_38>": 66,
      "<extra_id_37>": 67,
      "<extra_id_36>": 68,
      "<extra_id_35>": 69,
      "<extra_id_34>": 70,
      "<extra_id_33>": 71,
      "<extra_id_32>": 72,
      "<extra_id_31>": 73,
      "<extra_id_30>": 74,
      "<extra_id_29>": 75,
      "<extra_id_28>": 76,
      "<extra_id_27>": 77,
      "<extra_id_26>": 78,
      "<extra_id_25>": 79,
      "<extra_id_24>": 80,
      "<extra_id_23>": 81,
      "<extra_id_22>": 82,
      "<extra_id_21>": 83,
      "<extra_id_20>": 84,
      "<extra_id_19>": 85,
      "<extra_id_18>": 86,
      "<extra_id_17>": 87,
      "<extra_id_16>": 88,
      "<extra_id_15>": 89,
      "<extra_id_14>": 90,
      "<extra_id_13>": 91,
      "<extra_id_12>": 92,
      "<extra_id_11>": 93,
      "<extra_id_10>": 94,
      "<extra_id_9>": 95,
      "<extra_id_8>": 96,
      "<extra_id_7>": 97,
      "<extra_id_6>": 98,
      "<extra_id_5>": 99,
      "<extra_id_4>": 100,
      "<extra_id_3>": 101,
      "<extra_id_2>": 102,
      "<extra_id_1>": 103,
      "<extra_id_0>": 104,
      "!": 105,
      "\"": 106,
      "#": 107,
      "$": 108,
      "%": 109,
      "&": 110,
      "'": 111,
      "(": 112,
      ")": 113,
      "*": 114,
      "+": 115,
      ",": 116,
      "-": 117,
      ".": 118,
      "/": 119,
      "0": 120,
      "1": 121,
      "2": 122,
      "3": 123,
      "4": 124,
      "5": 125,
      "6": 126,
      "7": 127,
      "8": 128,
      "9": 129,
      ":": 130,
      ";": 131,
      "<": 132,
      "=": 133,
      ">": 134,
      "?": 135,
      "@": 136,
      "A": 137,
      "B": 138,
      "C": 139,
      "D": 140,
      "E": 141,
      "F": 142,
      "G": 143,
      "H": 144,
      "I": 145,
      "J": 146,
      "K": 147,
      "L": 148,
      "M": 149,
      "N": 150,
      "O": 151,
      "P": 152,
      "Q": 153,
      "R": 154,
      "S": 155,
      "T": 156,
      "U": 157,
      "V": 158,
      "W": 159,
      "X": 160,
      "Y": 161,
      "Z": 162,
      "[": 163,
      "\\": 164,
      "]": 165,
      "^": 166,
      "_": 167,
      "`": 168,
      "a": 169,
      "b": 170,
      "c": 171,
      "d": 172,
      "e": 173,
      "f": 174,
      "g": 175,
      "h": 176,
      "i": 177,
      "j": 178,
      "k": 179,
      "l": 180,
      "m": 181,
      "n": 182,
      "o": 183,
      "p": 184,
      "q": 185,
      "r": 186,
      "s": 187,
      "t": 188,
      "u": 189,
      "v": 190,
      "w": 191,
      "x": 192,
      "y": 193,
      "z": 194,
      "{": 195,
      "|": 196,
      "}": 197,
      "~": 198,
      "¡": 199,
      "¢": 200,
      "£": 201,
      "¤": 202,
      "¥": 203,
      "¦": 204,
      "§": 205,
      "¨": 206,
      "©": 207,
      "ª": 208,
      "«": 209,
      "¬": 210,
      "®": 211,
      "¯": 212,
      "°": 213,
      "±": 214,
      "²": 215,
      "³": 216,
      "´": 217,
      "µ": 218,
      "¶": 219,
      "·": 220,
      "¸": 221,
      "¹": 222,
      "º": 223,
      "»": 224,
      "¼": 225,
      "½": 226,
      "¾": 227,
      "¿": 228,
      "À": 229,
      "Á": 230,
      "Â": 231,
      "Ã": 232,
      "Ä": 233,
      "Å": 234,
      "Æ": 235,
      "Ç": 236,
      "È": 237,
      "É": 238,
      "Ê": 239,
      "Ë": 240,
      "Ì": 241,
      "Í": 242,
      "Î": 243,
      "Ï": 244,
      "Ð": 245,
      "Ñ": 246,
      "Ò": 247,
      "Ó": 248,
      "Ô": 249,
      "Õ": 250,
      "Ö": 251,
      "×": 252,
      "Ø": 253,
      "Ù": 254,
      "Ú": 255,
      "Û": 256,
      "Ü": 257,
      "Ý": 258,
      "Þ": 259,
      "ß": 260,
      "à": 261,
      "á": 262,
      "â": 263,
      "ã": 264,
      "ä": 265,
      "å": 266,
      "æ": 267,
      "ç": 268,
      "è": 269,
      "é": 270,
      "ê": 271,
      "ë": 272,
      "ì": 273,
      "í": 274,
      "î": 275,
      "ï": 276,
      "ð": 277,
      "ñ": 278,
      "ò": 279,
      "ó": 280,
      "ô": 281,
      "õ": 282,
      "ö": 283,
      "÷": 284,
      "ø": 285,
      "ù": 286,
      "ú": 287,
      "û": 288,
      "ü": 289,
      "ý": 290,
      "þ": 291,
      "ÿ": 292,
      "Ā": 293,
      "ā": 294,
      "Ă": 295,
      "ă": 296,
      "Ą": 297,
      "ą": 298,
      "Ć": 299,
      "ć": 300,
      "Ĉ": 301,
      "ĉ": 302,
      "Ċ": 303,
      "ċ": 304,
      "Č": 305,
      "č": 306,
      "Ď": 307,
      "ď": 308,
      "Đ": 309,
      "đ": 310,
      "Ē": 311,
      "ē": 312,
      "Ĕ": 313,
      "ĕ": 314,
      "Ė": 315,
      "ė": 316,
      "Ę": 317,
      "ę": 318,
      "Ě": 319,
      "ě": 320,
      "Ĝ": 321,
      "ĝ": 322,
      "Ğ": 323,
      "ğ": 324,
      "Ġ": 325,
      "ġ": 326,
      "Ģ": 327,
      "ģ": 328,
      "Ĥ": 329,
      "ĥ": 330,
      "Ħ": 331,
      "ħ": 332,
      "Ĩ": 333,
      "ĩ": 334,
      "Ī": 335,
      "ī": 336,
      "Ĭ": 337,
      "ĭ": 338,
      "Į": 339,
      "į": 340,
      "İ": 341,
      "ı": 342,
      "Ĳ": 343,
      "ĳ": 344,
      "Ĵ": 345,
      "ĵ": 346,
      "Ķ": 347,
      "ķ": 348,
      "ĸ": 349,
      "Ĺ": 350,
      "ĺ": 351,
      "Ļ": 352,
      "ļ": 353,
      "Ľ": 354,
      "ľ": 355,
      "Ŀ": 356,
      "ŀ": 357,
      "Ł": 358,
      "ł": 359,
      "Ń": 360,
      "ĠĠ": 361,
      "ĠĠĠĠ": 362,
      ";\\": 363,
      "in": 364,
      "re": 365,
      "Ġ*": 366,
      "ĠĠĠ": 367,
      "ĠĠĠĠĠĠĠĠ": 368,
      "**": 369,
      "st": 370,
      "Ġ0": 371,
      "Ġ=": 372,
      "er": 373,
      "Ġ(": 374,
      "at": 375,
      ");\\": 376,
      "Ġt": 377,
      "->": 378,
      "de": 379,
      "on": 380,
      "00": 381,
      "se": 382,
      "en": 383,
      "--": 384,
      "Ġc": 385,
      "if": 386,
      ",\\": 387,
      "or": 388,
      "ar": 389,
      "al": 390,
      "****": 391,
      "le": 392,
      "he": 393,
      "it": 394,
      "{\\": 395,
      "ct": 396,
      "int": 397,
      "an": 398,
      "\\\\": 399,
      "Ġs": 400,
      "}\\": 401,
      ")\\": 402,
      "/*": 403,
      "/\\": 404,
      "Ġp": 405,
      "Ġf": 406,
      "ur": 407,
      "Ġ*/\\": 408,
      "me": 409,
      "Ġb": 410,
      "ic": 411,
      "Ġre": 412,
      "Ġthe": 413,
      "lo": 414,
      "Ġa": 415,
      "ĠĠĠĠĠĠĠ": 416,
      "----": 417,
      "un": 418,
      "is": 419,
      "str": 420,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 421,
      "Ġ{\\": 422,
      "Ġ\"": 423,
      "ed": 424,
      "ut": 425,
      "Ġo": 426,
      "Ġ1": 427,
      "==": 428,
      "id": 429,
      "ion": 430,
      "ro": 431,
      "ĠĠĠĠĠ": 432,
      "Ġn": 433,
      "********": 434,
      "ad": 435,
      "Ġif": 436,
      "urn": 437,
      "et": 438,
      "tr": 439,
      "Ġ&": 440,
      "Ġw": 441,
      "el": 442,
      "__": 443,
      "turn": 444,
      "stat": 445,
      "mp": 446,
      "IN": 447,
      "ck": 448,
      "Ġd": 449,
      "Ġm": 450,
      "ing": 451,
      "ff": 452,
      "ex": 453,
      "ig": 454,
      "ch": 455,
      "es": 456,
      "ĠS": 457,
      "Ġ/*": 458,
      "\\'": 459,
      "LL": 460,
      "tif": 461,
      "ĠN": 462,
      "RE": 463,
      "co": 464,
      "Ġv": 465,
      "ER": 466,
      "iz": 467,
      "ag": 468,
      "Ġin": 469,
      "Ġint": 470,
      "Ġ-": 471,
      "ĠT": 472,
      "uct": 473,
      "ame": 474,
      "as": 475,
      "Ġl": 476,
      "pe": 477,
      "struct": 478,
      "ize": 479,
      "ot": 480,
      "Ġ<": 481,
      "and": 482,
      "Ġ}\\": 483,
      "ĠP": 484,
      "ase": 485,
      "tre": 486,
      "ĠC": 487,
      "Ġto": 488,
      "def": 489,
      "ul": 490,
      "0000": 491,
      "set": 492,
      "ab": 493,
      "--------": 494,
      "Ġi": 495,
      "ue": 496,
      "cl": 497,
      "32": 498,
      "ĠA": 499,
      "ULL": 500,
      "ent": 501,
      "us": 502,
      "\",": 503,
      "Ġ==": 504,
      "il": 505,
      "ĠF": 506,
      "op": 507,
      "ce": 508,
      "ata": 509,
      "Ġg": 510,
      "ap": 511,
      "err": 512,
      "====": 513,
      "Ġ+": 514,
      "ode": 515,
      "Ġ2": 516,
      "ile": 517,
      "um": 518,
      "dev": 519,
      "DE": 520,
      ".\\": 521,
      "Ġ{": 522,
      "ON": 523,
      "th": 524,
      "ST": 525,
      "OR": 526,
      "Ġreturn": 527,
      "con": 528,
      "ĠĠĠĠĠĠĠĠĠĠĠ": 529,
      "static": 530,
      "Ġof": 531,
      "pr": 532,
      "iv": 533,
      "oid": 534,
      "ine": 535,
      "Ġ}": 536,
      "ol": 537,
      "ĠNULL": 538,
      "SE": 539,
      "ist": 540,
      "bu": 541,
      ":\\": 542,
      "IT": 543,
      "Ġ|": 544,
      "Ġis": 545,
      "Ġ\\": 546,
      "****************": 547,
      "ĠI": 548,
      "up": 549,
      "Ġh": 550,
      "Ġcon": 551,
      "Ġth": 552,
      "nstatic": 553,
      "ate": 554,
      "))": 555,
      "end": 556,
      "fo": 557,
      "ext": 558,
      "Ġfor": 559,
      "ss": 560,
      "nt": 561,
      "AT": 562,
      "ype": 563,
      "Ġch": 564,
      "treturn": 565,
      "dr": 566,
      "EN": 567,
      "Ġr": 568,
      "AL": 569,
      "AR": 570,
      "ĠM": 571,
      "am": 572,
      "ts": 573,
      "ite": 574,
      "ak": 575,
      "16": 576,
      "else": 577,
      "Ġ!": 578,
      "Ġu": 579,
      "able": 580,
      "arg": 581,
      "val": 582,
      "ay": 583,
      "ĠG": 584,
      "ign": 585,
      "te": 586,
      "),": 587,
      "lock": 588,
      "ir": 589,
      "len": 590,
      "data": 591,
      "ip": 592,
      "clu": 593,
      "of": 594,
      "ĠL": 595,
      "ĠR": 596,
      "ort": 597,
      "clude": 598,
      "LE": 599,
      "ect": 600,
      "//": 601,
      "Ġ%": 602,
      "Ġ__": 603,
      "ĠO": 604,
      "ub": 605,
      "name": 606,
      "im": 607,
      "ation": 608,
      "py": 609,
      "ma": 610,
      "tc": 611,
      "ĠD": 612,
      "Ġand": 613,
      "));\\": 614,
      "loc": 615,
      "ib": 616,
      "(\"": 617,
      "MA": 618,
      "Ġ*\\": 619,
      "ree": 620,
      "include": 621,
      "to": 622,
      "Ġ\\'": 623,
      "FF": 624,
      "size": 625,
      "reak": 626,
      "ack": 627,
      "Ġchar": 628,
      "ve": 629,
      "Ġ!=": 630,
      "all": 631,
      "10": 632,
      "Ġe": 633,
      "io": 634,
      "++": 635,
      "ult": 636,
      "info": 637,
      "sc": 638,
      "age": 639,
      "AN": 640,
      "ow": 641,
      "ĠE": 642,
      "Ġbe": 643,
      "ĠĠĠĠĠĠ": 644,
      "ĠB": 645,
      "sign": 646,
      "Ġ>": 647,
      "----------------": 648,
      "\"\\": 649,
      "(&": 650,
      "ter": 651,
      "64": 652,
      "out": 653,
      "void": 654,
      "\");\\": 655,
      "ac": 656,
      "ix": 657,
      "CT": 658,
      "bj": 659,
      "SI": 660,
      "11": 661,
      "Ġco": 662,
      "Ġ&&": 663,
      "Ġ3": 664,
      "type": 665,
      "ction": 666,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 667,
      "tp": 668,
      "Ġelse": 669,
      "========": 670,
      "ver": 671,
      "art": 672,
      "lag": 673,
      "Ġsize": 674,
      "sp": 675,
      "get": 676,
      "buf": 677,
      "ĠW": 678,
      "define": 679,
      "signed": 680,
      "ew": 681,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 682,
      "are": 683,
      "Ġ((": 684,
      "print": 685,
      "mem": 686,
      "12": 687,
      "unsigned": 688,
      "ice": 689,
      "ME": 690,
      "error": 691,
      "SS": 692,
      "Ġst": 693,
      "Ġ4": 694,
      "Ġx": 695,
      "Ġstruct": 696,
      "ith": 697,
      "for": 698,
      "UT": 699,
      "state": 700,
      "igh": 701,
      "Ġde": 702,
      "tb": 703,
      "AD": 704,
      "od": 705,
      "ms": 706,
      "000": 707,
      "CH": 708,
      "Ġvoid": 709,
      "put": 710,
      "Ġse": 711,
      "reg": 712,
      "Ġcase": 713,
      "ffer": 714,
      "LO": 715,
      "read": 716,
      "77": 717,
      "RO": 718,
      "UN": 719,
      "pl": 720,
      "ke": 721,
      "unt": 722,
      "xf": 723,
      "24": 724,
      "nd": 725,
      "mm": 726,
      "Ġ)": 727,
      "},\\": 728,
      "res": 729,
      "\",\\": 730,
      "ime": 731,
      "((": 732,
      "rc": 733,
      "Ġ},\\": 734,
      "Ġit": 735,
      "Ġconst": 736,
      "ong": 737,
      "xe": 738,
      "ptr": 739,
      "FI": 740,
      "Ġpro": 741,
      "ace": 742,
      "INT": 743,
      "Ġon": 744,
      "Ġ(!": 745,
      "20": 746,
      "CE": 747,
      ">\\": 748,
      "pyx": 749,
      "PE": 750,
      "In": 751,
      "ĠĠĠĠĠĠĠĠĠ": 752,
      "char": 753,
      "po": 754,
      "endif": 755,
      "ID": 756,
      "ERR": 757,
      "))\\": 758,
      "ser": 759,
      "Ġnot": 760,
      "pro": 761,
      "];\\": 762,
      "Ġor": 763,
      "GE": 764,
      "Ġval": 765,
      "Ġthis": 766,
      "lags": 767,
      "TR": 768,
      "Ġ*)": 769,
      "tw": 770,
      "US": 771,
      "Ġby": 772,
      "dd": 773,
      "ers": 774,
      "rite": 775,
      "].": 776,
      "80": 777,
      "Ġan": 778,
      "Ġ||": 779,
      "ffset": 780,
      "ind": 781,
      "code": 782,
      "und": 783,
      "********************************": 784,
      "ĠH": 785,
      "ta": 786,
      "par": 787,
      "25": 788,
      "CO": 789,
      "pt": 790,
      "ight": 791,
      "/*\\": 792,
      "key": 793,
      "TI": 794,
      "dex": 795,
      "MP": 796,
      "addr": 797,
      "text": 798,
      "Ġ);\\": 799,
      "fd": 800,
      "Ġwith": 801,
      "qu": 802,
      "alloc": 803,
      "bject": 804,
      "printf": 805,
      "ED": 806,
      "CK": 807,
      "rom": 808,
      "ly": 809,
      "tcase": 810,
      "Ġwh": 811,
      "ment": 812,
      "Ġy": 813,
      "tstruct": 814,
      "IS": 815,
      "Ġbu": 816,
      "ure": 817,
      "oto": 818,
      "file": 819,
      "LA": 820,
      "list": 821,
      "init": 822,
      "db": 823,
      "Ġbreak": 824,
      "Re": 825,
      "xb": 826,
      "nc": 827,
      "no": 828,
      "Ġex": 829,
      "),\\": 830,
      "23": 831,
      "Ġ5": 832,
      "try": 833,
      "EX": 834,
      "Ġwe": 835,
      "status": 836,
      "que": 837,
      "cc": 838,
      "num": 839,
      "Ġ_": 840,
      "ast": 841,
      "99": 842,
      "per": 843,
      "pre": 844,
      "tx": 845,
      "Ġthat": 846,
      "sy": 847,
      "TY": 848,
      "ang": 849,
      "01": 850,
      "md": 851,
      "Ġj": 852,
      "ql": 853,
      "port": 854,
      "ctx": 855,
      "low": 856,
      "tint": 857,
      "ess": 858,
      "Ġdo": 859,
      "VAL": 860,
      "ive": 861,
      "BU": 862,
      "Ġstr": 863,
      "lin": 864,
      "Ġ8": 865,
      "map": 866,
      "ord": 867,
      "ide": 868,
      "ave": 869,
      "Ġuse": 870,
      "*/\\": 871,
      "xd": 872,
      "sh": 873,
      "ial": 874,
      "13": 875,
      "bo": 876,
      "Ġso": 877,
      "IO": 878,
      "ĠU": 879,
      "Ġen": 880,
      "AB": 881,
      "arr": 882,
      "tg": 883,
      "ty": 884,
      "rr": 885,
      "Ġ\\\\": 886,
      "heck": 887,
      "cp": 888,
      "so": 889,
      "gth": 890,
      "REG": 891,
      "OP": 892,
      "15": 893,
      "device": 894,
      "<<": 895,
      "xff": 896,
      "mple": 897,
      "free": 898,
      "ask": 899,
      "ath": 900,
      "ING": 901,
      "Ġsh": 902,
      "Ġfile": 903,
      "Ġtr": 904,
      "377": 905,
      "40": 906,
      "Ġsizeof": 907,
      "Ġlen": 908,
      "em": 909,
      "line": 910,
      "Ġpo": 911,
      "Ġ)\\": 912,
      "();\\": 913,
      "xc": 914,
      "ĠV": 915,
      "tu": 916,
      "tbreak": 917,
      "fs": 918,
      "Ġout": 919,
      "ĠThe": 920,
      "LIT": 921,
      "value": 922,
      "qlite": 923,
      "cur": 924,
      "Ġ+=": 925,
      "ibut": 926,
      "Ġdata": 927,
      "mat": 928,
      "..": 929,
      "14": 930,
      "],": 931,
      "ill": 932,
      "his": 933,
      "flags": 934,
      "___": 935,
      "ev": 936,
      "Ġ<<": 937,
      "pc": 938,
      "rent": 939,
      "ber": 940,
      "ass": 941,
      "unction": 942,
      "opy": 943,
      "add": 944,
      "CON": 945,
      ");": 946,
      "ore": 947,
      "ash": 948,
      "NO": 949,
      "ard": 950,
      "bit": 951,
      "Ġ:": 952,
      "Ġal": 953,
      "ions": 954,
      "50": 955,
      "Ġare": 956,
      "30": 957,
      "Ġres": 958,
      "mb": 959,
      "head": 960,
      "Ġat": 961,
      "ress": 962,
      "xa": 963,
      "const": 964,
      "TYPE": 965,
      "one": 966,
      "Ġ6": 967,
      "Ġ//": 968,
      "St": 969,
      "gr": 970,
      "Ġas": 971,
      "Ġreg": 972,
      "ann": 973,
      "inter": 974,
      "mo": 975,
      "ire": 976,
      "priv": 977,
      "================": 978,
      "TH": 979,
      "ee": 980,
      "Ġdef": 981,
      "td": 982,
      "cr": 983,
      "fig": 984,
      ")(": 985,
      "UE": 986,
      "Ġset": 987,
      "Ġ@": 988,
      "mode": 989,
      "fr": 990,
      "ĠThis": 991,
      "next": 992,
      "act": 993,
      "AP": 994,
      "DR": 995,
      "log": 996,
      "est": 997,
      "ĠX": 998,
      "Ġk": 999,
      "ans": 1000,
      "buffer": 1001,
      "count": 1002,
      "ail": 1003,
      "VE": 1004,
      "UL": 1005,
      "SET": 1006,
      "ust": 1007,
      "ory": 1008,
      "ORT": 1009,
      "Con": 1010,
      "Ġpr": 1011,
      "LI": 1012,
      "Ġfrom": 1013,
      "ml": 1014,
      "ng": 1015,
      "ener": 1016,
      "ost": 1017,
      "Ġlong": 1018,
      "ZE": 1019,
      "Ġunsigned": 1020,
      "Ġz": 1021,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1022,
      "Ġret": 1023,
      "fe": 1024,
      "ok": 1025,
      "Ġarg": 1026,
      "array": 1027,
      "SC": 1028,
      "00000000": 1029,
      "nvoid": 1030,
      "--------------------------------": 1031,
      "Ġerror": 1032,
      "andle": 1033,
      "NE": 1034,
      "ax": 1035,
      "node": 1036,
      "36": 1037,
      "Ġsqlite": 1038,
      "18": 1039,
      "Ġ**": 1040,
      "write": 1041,
      "use": 1042,
      "Ġvalue": 1043,
      "()": 1044,
      "STAT": 1045,
      "02": 1046,
      "eg": 1047,
      "start": 1048,
      "DI": 1049,
      "UR": 1050,
      "19": 1051,
      "MO": 1052,
      "by": 1053,
      "17": 1054,
      "icen": 1055,
      "ull": 1056,
      "ifdef": 1057,
      "ph": 1058,
      "Ġnum": 1059,
      "22": 1060,
      "ault": 1061,
      "av": 1062,
      "ity": 1063,
      "time": 1064,
      "SIZE": 1065,
      "icense": 1066,
      "Ġmem": 1067,
      "ll": 1068,
      "};\\": 1069,
      "NU": 1070,
      "new": 1071,
      "fix": 1072,
      "AS": 1073,
      "HE": 1074,
      "ache": 1075,
      "Ġ16": 1076,
      "PR": 1077,
      "unc": 1078,
      "ux": 1079,
      "mt": 1080,
      "tes": 1081,
      "Py": 1082,
      "li": 1083,
      "PC": 1084,
      "Ġ/": 1085,
      "86": 1086,
      "string": 1087,
      "ream": 1088,
      "ERROR": 1089,
      "Ġname": 1090,
      "BUG": 1091,
      "pec": 1092,
      "55": 1093,
      "Co": 1094,
      "tm": 1095,
      "ary": 1096,
      "04": 1097,
      "do": 1098,
      "INVAL": 1099,
      "ret": 1100,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1101,
      "AME": 1102,
      "ern": 1103,
      "*/": 1104,
      "ĠPy": 1105,
      "index": 1106,
      "Ġro": 1107,
      "ister": 1108,
      "Ġus": 1109,
      "%%": 1110,
      "attr": 1111,
      "param": 1112,
      "Ġ7": 1113,
      "Ġcur": 1114,
      "Ġle": 1115,
      "offset": 1116,
      "Ġget": 1117,
      "NULL": 1118,
      "**\\": 1119,
      "ĠĠĠĠĠĠĠĠĠĠĠĠ": 1120,
      "AM": 1121,
      "Ġpar": 1122,
      "Ġme": 1123,
      "++;\\": 1124,
      "tmp": 1125,
      "ound": 1126,
      "urce": 1127,
      "ld": 1128,
      "tf": 1129,
      "Ġun": 1130,
      "oftw": 1131,
      "oftware": 1132,
      "itch": 1133,
      "table": 1134,
      "Ġ*/": 1135,
      "msg": 1136,
      "Ġcode": 1137,
      "di": 1138,
      "ci": 1139,
      "Ġnew": 1140,
      "uld": 1141,
      "ENT": 1142,
      "ubl": 1143,
      "nint": 1144,
      "Err": 1145,
      "ĠIN": 1146,
      "IP": 1147,
      "FA": 1148,
      "base": 1149,
      "ert": 1150,
      "DEBUG": 1151,
      "ule": 1152,
      "TE": 1153,
      "tl": 1154,
      "Ġop": 1155,
      "Ġadd": 1156,
      "sa": 1157,
      "ined": 1158,
      "08": 1159,
      "xB": 1160,
      "28": 1161,
      "ec": 1162,
      "xE": 1163,
      "Object": 1164,
      "SP": 1165,
      "CL": 1166,
      "ĠAN": 1167,
      "ated": 1168,
      "UP": 1169,
      "telse": 1170,
      "Ġfunction": 1171,
      "Ġ?": 1172,
      "annel": 1173,
      "irst": 1174,
      "uint": 1175,
      "Ġcan": 1176,
      "Ġbit": 1177,
      "26": 1178,
      "src": 1179,
      "right": 1180,
      "Ġ9": 1181,
      "opt": 1182,
      "col": 1183,
      "ies": 1184,
      "OK": 1185,
      "ep": 1186,
      "34": 1187,
      "Ġ(*": 1188,
      "witch": 1189,
      "Ġsy": 1190,
      "quest": 1191,
      "tfor": 1192,
      "STR": 1193,
      "Ġ|=": 1194,
      "tgoto": 1195,
      "ĠĠĠĠĠĠĠĠĠĠ": 1196,
      "PO": 1197,
      "iel": 1198,
      "27": 1199,
      "ĠOP": 1200,
      "Ġ>>": 1201,
      "56": 1202,
      "ou": 1203,
      "ION": 1204,
      "ns": 1205,
      "back": 1206,
      "LITE": 1207,
      "Ġgoto": 1208,
      "max": 1209,
      "tro": 1210,
      "Get": 1211,
      "INE": 1212,
      "QLITE": 1213,
      "reate": 1214,
      "tv": 1215,
      "ield": 1216,
      "Ġerr": 1217,
      "ĠIf": 1218,
      "IG": 1219,
      "lf": 1220,
      "SH": 1221,
      "ant": 1222,
      "VI": 1223,
      "\\',": 1224,
      "ĠLicense": 1225,
      "stribut": 1226,
      "ange": 1227,
      "ain": 1228,
      "Ġ\\\\\\": 1229,
      "Ġ>=": 1230,
      "++)": 1231,
      "Ġ\"\\\\": 1232,
      "pos": 1233,
      "88": 1234,
      "Str": 1235,
      "90": 1236,
      "AC": 1237,
      "PORT": 1238,
      "comp": 1239,
      "block": 1240,
      "96": 1241,
      "ĠCON": 1242,
      "tree": 1243,
      "tin": 1244,
      "Ġtmp": 1245,
      "min": 1246,
      "]);\\": 1247,
      "ALL": 1248,
      "FO": 1249,
      "PRO": 1250,
      "VER": 1251,
      "req": 1252,
      "Ġass": 1253,
      "entry": 1254,
      "ALSE": 1255,
      "form": 1256,
      "Data": 1257,
      "xx": 1258,
      "33": 1259,
      "sk": 1260,
      "bug": 1261,
      "std": 1262,
      "Ġtype": 1263,
      "Ġlist": 1264,
      "54": 1265,
      "Ġad": 1266,
      "IC": 1267,
      "Par": 1268,
      "Ġsc": 1269,
      "rit": 1270,
      "97": 1271,
      "ATE": 1272,
      "pp": 1273,
      "ild": 1274,
      "sub": 1275,
      "Ġresult": 1276,
      "aw": 1277,
      "ork": 1278,
      "acket": 1279,
      "Ġwill": 1280,
      "Ch": 1281,
      "Ġread": 1282,
      "Ġhave": 1283,
      "sn": 1284,
      "Ġ},": 1285,
      "BA": 1286,
      "Info": 1287,
      "Val": 1288,
      "Ġbuffer": 1289,
      "Ġ[": 1290,
      "84": 1291,
      "idth": 1292,
      "length": 1293,
      "},": 1294,
      "Ġoffset": 1295,
      "Ġ10": 1296,
      "Ġpre": 1297,
      "Ex": 1298,
      "ĠFT": 1299,
      "Ġany": 1300,
      "FFFF": 1301,
      "OL": 1302,
      "ake": 1303,
      "SY": 1304,
      "own": 1305,
      "PI": 1306,
      "37": 1307,
      "fil": 1308,
      "DB": 1309,
      "cmd": 1310,
      "Ġlo": 1311,
      "ould": 1312,
      "dis": 1313,
      "MAX": 1314,
      "ĠOR": 1315,
      "loat": 1316,
      "stream": 1317,
      "Ġdis": 1318,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1319,
      "OT": 1320,
      "sion": 1321,
      "Ġstate": 1322,
      "conn": 1323,
      "tk": 1324,
      "Ġcomp": 1325,
      "os": 1326,
      "ge": 1327,
      "Un": 1328,
      "ele": 1329,
      "arget": 1330,
      "Ġuint": 1331,
      "opyright": 1332,
      "Ġbuf": 1333,
      "Ġup": 1334,
      "ĠOF": 1335,
      "cs": 1336,
      "CI": 1337,
      "cess": 1338,
      "roup": 1339,
      "EXT": 1340,
      "Ġhe": 1341,
      "ABLE": 1342,
      "ET": 1343,
      "FT": 1344,
      "comm": 1345,
      "Ġwhile": 1346,
      "net": 1347,
      "CR": 1348,
      "Ġ32": 1349,
      "Ġend": 1350,
      "ĠĠĠĠĠĠĠĠĠĠĠĠĠĠ": 1351,
      "header": 1352,
      "be": 1353,
      "mask": 1354,
      "ps": 1355,
      "Ġno": 1356,
      "Type": 1357,
      "irq": 1358,
      "KE": 1359,
      "atch": 1360,
      "[]": 1361,
      "cpu": 1362,
      "pi": 1363,
      "OUT": 1364,
      "ersion": 1365,
      "Lo": 1366,
      "Ġmod": 1367,
      "Ġarray": 1368,
      "desc": 1369,
      "path": 1370,
      "vent": 1371,
      "config": 1372,
      "*)": 1373,
      "FLA": 1374,
      "ded": 1375,
      "35": 1376,
      "om": 1377,
      "Ġcall": 1378,
      "xC": 1379,
      "94": 1380,
      "GET": 1381,
      "red": 1382,
      "iver": 1383,
      "tt": 1384,
      "Ġfree": 1385,
      "Ġrc": 1386,
      "Ġ.": 1387,
      "Bu": 1388,
      "lose": 1389,
      "87": 1390,
      "Ġ#": 1391,
      "ef": 1392,
      "xF": 1393,
      "Set": 1394,
      "ud": 1395,
      "imer": 1396,
      "Ptr": 1397,
      "Int": 1398,
      "IL": 1399,
      "ATA": 1400,
      "cmp": 1401,
      "SR": 1402,
      "ublic": 1403,
      "ther": 1404,
      "utex": 1405,
      "ĠIn": 1406,
      "SK": 1407,
      "60": 1408,
      "emp": 1409,
      "Ġfr": 1410,
      "Ġprint": 1411,
      "Ġopt": 1412,
      "arch": 1413,
      "mod": 1414,
      "old": 1415,
      ")->": 1416,
      "RF": 1417,
      "idx": 1418,
      "indow": 1419,
      "Ġall": 1420,
      "Error": 1421,
      "lay": 1422,
      "DEF": 1423,
      "gram": 1424,
      "Ġtime": 1425,
      "cb": 1426,
      "local": 1427,
      "frame": 1428,
      "face": 1429,
      "vel": 1430,
      "dst": 1431,
      "PRE": 1432,
      "FIG": 1433,
      "ush": 1434,
      "xA": 1435,
      "lean": 1436,
      "Name": 1437,
      "ĠGener": 1438,
      "Ġ(\"": 1439,
      "66": 1440,
      "Ġav": 1441,
      "uble": 1442,
      "Ġq": 1443,
      "IM": 1444,
      "29": 1445,
      "Ġtable": 1446,
      "44": 1447,
      "istribut": 1448,
      "trol": 1449,
      "57": 1450,
      "ition": 1451,
      "led": 1452,
      "ten": 1453,
      "date": 1454,
      "ĠTR": 1455,
      "link": 1456,
      "BIT": 1457,
      "ipt": 1458,
      "SU": 1459,
      "ument": 1460,
      "iled": 1461,
      "ator": 1462,
      "PA": 1463,
      "Ġne": 1464,
      "ient": 1465,
      "ĠJ": 1466,
      "func": 1467,
      "03": 1468,
      "07": 1469,
      "var": 1470,
      "Ġkey": 1471,
      "sert": 1472,
      "ĠGNU": 1473,
      "USE": 1474,
      "linux": 1475,
      "Ġcheck": 1476,
      "SN": 1477,
      "][": 1478,
      "andl": 1479,
      "Ġmode": 1480,
      "bl": 1481,
      "context": 1482,
      "TO": 1483,
      "dir": 1484,
      "CP": 1485,
      "MS": 1486,
      "****************************************************************": 1487,
      "Ġused": 1488,
      "Ġcl": 1489,
      "queue": 1490,
      "Ġ<=": 1491,
      "fixed": 1492,
      "WR": 1493,
      "sg": 1494,
      "AND": 1495,
      "hed": 1496,
      "hw": 1497,
      "ach": 1498,
      "Ġbut": 1499,
      "tunsigned": 1500,
      "fl": 1501,
      "Ġnumber": 1502,
      "pen": 1503,
      "lob": 1504,
      "68": 1505,
      "END": 1506,
      "List": 1507,
      "MEM": 1508,
      "event": 1509,
      "(*": 1510,
      "valid": 1511,
      "Ġblock": 1512,
      "Ġ\"%": 1513,
      "ance": 1514,
      "ĠPublic": 1515,
      "MD": 1516,
      "21": 1517,
      "alse": 1518,
      "Ġstart": 1519,
      "unk": 1520,
      "user": 1521,
      "tn": 1522,
      "obj": 1523,
      "ca": 1524,
      "main": 1525,
      "Pro": 1526,
      "ref": 1527,
      "Ġversion": 1528,
      "Ġdefined": 1529,
      "temp": 1530,
      "READ": 1531,
      "OC": 1532,
      "31": 1533,
      "SA": 1534,
      "Ġshould": 1535,
      "Ġper": 1536,
      "ich": 1537,
      "Ġstatus": 1538,
      "Ġ){\\": 1539,
      "ailed": 1540,
      "FLAG": 1541,
      "Ġmust": 1542,
      "xD": 1543,
      "ump": 1544,
      "row": 1545,
      "cpy": 1546,
      "GL": 1547,
      "ĠY": 1548,
      "ĠFALSE": 1549,
      "NAME": 1550,
      "ĠGeneral": 1551,
      "tain": 1552,
      "ell": 1553,
      "ify": 1554,
      "LOCK": 1555,
      "word": 1556,
      "item": 1557,
      "REF": 1558,
      "ITE": 1559,
      "ename": 1560,
      "MB": 1561,
      "Ġflags": 1562,
      "ameter": 1563,
      "ML": 1564,
      "38": 1565,
      "tret": 1566,
      "ft": 1567,
      "test": 1568,
      "irect": 1569,
      "ait": 1570,
      "lib": 1571,
      "Ġindex": 1572,
      "STATUS": 1573,
      "play": 1574,
      "lat": 1575,
      "open": 1576,
